; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types
        car - object
        location - object )

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))


   (:action board
       :parameters (?car - car ?loc - location)
       :precondition  (and  (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters  (?car - car  ?loc - location)
       :precondition  (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
;; cars=12, locations=11, out_folder=training/easy, instance_id=64, seed=94

(define (problem ferry-64)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 car12 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc9)
    (at car1 loc3)
    (at car2 loc2)
    (at car3 loc5)
    (at car4 loc5)
    (at car5 loc7)
    (at car6 loc1)
    (at car7 loc11)
    (at car8 loc8)
    (at car9 loc6)
    (at car10 loc5)
    (at car11 loc7)
    (at car12 loc10)
)
 (:goal  (and (at car1 loc6)
   (at car2 loc10)
   (at car3 loc1)
   (at car4 loc8)
   (at car5 loc1)
   (at car6 loc8)
   (at car7 loc6)
   (at car8 loc9)
   (at car9 loc7)
   (at car10 loc4)
   (at car11 loc1)
   (at car12 loc7))))

; plan
1. (sail loc9 loc11)
   deleted: (at-ferry loc9)
   added: (at-ferry loc11)
   goals met: 0 of 12
2. (board car7 loc11)
   deleted: (at car7 loc11) (empty-ferry)
   added: (on car7)
   goals met: 0 of 12
3. (sail loc11 loc6)
   deleted: (at-ferry loc11)
   added: (at-ferry loc6)
   goals met: 0 of 12
4. (debark car7 loc6)
   deleted: (on car7)
   added: (at car7 loc6) (empty-ferry)
   goals met: 1 of 12
5. (sail loc6 loc2)
   deleted: (at-ferry loc6)
   added: (at-ferry loc2)
   goals met: 1 of 12
6. (board car2 loc2)
   deleted: (at car2 loc2) (empty-ferry)
   added: (on car2)
   goals met: 1 of 12
7. (sail loc2 loc10)
   deleted: (at-ferry loc2)
   added: (at-ferry loc10)
   goals met: 1 of 12
8. (debark car2 loc10)
   deleted: (on car2)
   added: (at car2 loc10) (empty-ferry)
   goals met: 2 of 12
9. (board car12 loc10)
   deleted: (at car12 loc10) (empty-ferry)
   added: (on car12)
   goals met: 2 of 12
10. (sail loc10 loc7)
   deleted: (at-ferry loc10)
   added: (at-ferry loc7)
   goals met: 2 of 12
11. (debark car12 loc7)
   deleted: (on car12)
   added: (at car12 loc7) (empty-ferry)
   goals met: 3 of 12
12. (board car11 loc7)
   deleted: (at car11 loc7) (empty-ferry)
   added: (on car11)
   goals met: 3 of 12
13. (sail loc7 loc1)
   deleted: (at-ferry loc7)
   added: (at-ferry loc1)
   goals met: 3 of 12
14. (debark car11 loc1)
   deleted: (on car11)
   added: (at car11 loc1) (empty-ferry)
   goals met: 4 of 12
15. (sail loc1 loc3)
   deleted: (at-ferry loc1)
   added: (at-ferry loc3)
   goals met: 4 of 12
16. (board car1 loc3)
   deleted: (at car1 loc3) (empty-ferry)
   added: (on car1)
   goals met: 4 of 12
17. (sail loc3 loc6)
   deleted: (at-ferry loc3)
   added: (at-ferry loc6)
   goals met: 4 of 12
18. (debark car1 loc6)
   deleted: (on car1)
   added: (at car1 loc6) (empty-ferry)
   goals met: 5 of 12
19. (board car9 loc6)
   deleted: (at car9 loc6) (empty-ferry)
   added: (on car9)
   goals met: 5 of 12
20. (sail loc6 loc7)
   deleted: (at-ferry loc6)
   added: (at-ferry loc7)
   goals met: 5 of 12
21. (debark car9 loc7)
   deleted: (on car9)
   added: (at car9 loc7) (empty-ferry)
   goals met: 6 of 12
22. (board car5 loc7)
   deleted: (at car5 loc7) (empty-ferry)
   added: (on car5)
   goals met: 6 of 12
23. (sail loc7 loc1)
   deleted: (at-ferry loc7)
   added: (at-ferry loc1)
   goals met: 6 of 12
24. (debark car5 loc1)
   deleted: (on car5)
   added: (at car5 loc1) (empty-ferry)
   goals met: 7 of 12
25. (board car6 loc1)
   deleted: (at car6 loc1) (empty-ferry)
   added: (on car6)
   goals met: 7 of 12
26. (sail loc1 loc8)
   deleted: (at-ferry loc1)
   added: (at-ferry loc8)
   goals met: 7 of 12
27. (debark car6 loc8)
   deleted: (on car6)
   added: (at car6 loc8) (empty-ferry)
   goals met: 8 of 12
28. (board car8 loc8)
   deleted: (at car8 loc8) (empty-ferry)
   added: (on car8)
   goals met: 8 of 12
29. (sail loc8 loc9)
   deleted: (at-ferry loc8)
   added: (at-ferry loc9)
   goals met: 8 of 12
30. (debark car8 loc9)
   deleted: (on car8)
   added: (at car8 loc9) (empty-ferry)
   goals met: 9 of 12
31. (sail loc9 loc5)
   deleted: (at-ferry loc9)
   added: (at-ferry loc5)
   goals met: 9 of 12
32. (board car3 loc5)
   deleted: (at car3 loc5) (empty-ferry)
   added: (on car3)
   goals met: 9 of 12
33. (sail loc5 loc1)
   deleted: (at-ferry loc5)
   added: (at-ferry loc1)
   goals met: 9 of 12
34. (debark car3 loc1)
   deleted: (on car3)
   added: (at car3 loc1) (empty-ferry)
   goals met: 10 of 12
35. (sail loc1 loc5)
   deleted: (at-ferry loc1)
   added: (at-ferry loc5)
   goals met: 10 of 12
36. (board car10 loc5)
   deleted: (at car10 loc5) (empty-ferry)
   added: (on car10)
   goals met: 10 of 12
37. (sail loc5 loc4)
   deleted: (at-ferry loc5)
   added: (at-ferry loc4)
   goals met: 10 of 12
38. (debark car10 loc4)
   deleted: (on car10)
   added: (at car10 loc4) (empty-ferry)
   goals met: 11 of 12
39. (sail loc4 loc5)
   deleted: (at-ferry loc4)
   added: (at-ferry loc5)
   goals met: 11 of 12
40. (board car4 loc5)
   deleted: (at car4 loc5) (empty-ferry)
   added: (on car4)
   goals met: 11 of 12
41. (sail loc5 loc8)
   deleted: (at-ferry loc5)
   added: (at-ferry loc8)
   goals met: 11 of 12
42. (debark car4 loc8)
   deleted: (on car4)
   added: (at car4 loc8) (empty-ferry)
   goals met: 12 of 12
